# class Base:
#     text = ["Приветствуем вас в нашем приложении! Оно поможет вам лучше понимать себя, причины своих эмоций и поступков. Вы можете работать самостоятельно или использовать приложение в работе с психологом.",
#             "При разработке мы основывались на когнитивно-поведенческой терапии (КПТ) Аарона Бэка и рационально-эмоционально-поведенческой терапии (РЭПТ) Альберта Эллиса.Эти методики включают в себя различные понятия и технологии, которые позволяют вам самостоятельно работать с различными проблемами и решать их. Поэтому перед работой над собой стоит усвоить некоторые основы данных методик. И когда вы уже вооружитесь всем необходимым для вас, вы будете готовы посмотреть своим страхам в глаза!",
#             "Если вы работаете самостоятельно, для начала рекомендуем составить план работы - ведь КПТ и РЭПТ структурированные подходы. Главное не бояться брать на себя ответственность – успех зависит от твоей работы над собой. Желаем удачи!"]
#     title = ""
#     theme = "Основы"
#     type = 0
#     link = ""

class Cbt_base:
    id = "22cbb105-8857-48de-806d-7242ced60a97"
    text = ["""Предлагаем узнать побольше о самой методике когнитивно-поведенческой терапии (КПТ). Здесь собрана краткая, но ёмкая информация, которая поможет освоить метод самостоятельно или с психотерапевтом.
Основы КПТ заложил Аарон Бек, предположив, что в основе психологических трудностей лежат когнитивные ошибки — то есть неточности или искажения в мышлении. Когнитивные ошибки или же искажения в свою очередь присущи всем людям, они могут облегчать работу, если нам требуется быстро обрабатывать информацию, но могут и мешать в повседневной или профессиональной жизни, если наши суждения и выводы основываются на стереотипах. Они возникают из-за стремления мозга к упрощению информации.В процессе терапии человек учится видеть выход из ситуаций, которые раньше казались непреодолимыми, а также переосмысливать и корректировать своё мышление.
""",
            """КПТ зарекомендовала себя как эффективный подход в ряде научных исследований. Этот метод позволяет достаточно быстро достичь эффекта и сохранить его после завершения терапии. За счет работы с теми проблемами, которые волнуют сейчас, без подробного погружения в прошлое.
Чтобы успешно работать с трудностями, важно понять, как именно мысли, чувства и действия влияют друг на друга и на нас. Негативная мысль вызывает неприятные чувства, которые побуждают к действиям, не всегда полезным или разумным. В итоге человек застревает в порочном круге. По тому же принципу положительные мысли могут стимулировать положительные чувства и действия.
""",
            """В КПТ мыслям человека отводится ключевая роль. Иногда можно почувствовать себя философом, поскольку основной метод терапии — это вопросы к собственным мыслям, действиям и чувствам. Важно научиться ставить под сомнение убеждения и находить здоровую альтернативу разрушительным установкам. Такие установки — это негативные убеждения о себе, других или мире, которые мешают человеку чувствовать себя хорошо и принимать решения.
Что такое негативные мысли? Это название для удобства понимания. В основе КПТ лежит концепция автоматических мыслей — мыслей, которые возникают настолько привычно и незаметно, что их не подвергают сомнению, а это может повлиять на восприятие нас самих и нашего окружения!
Вот несколько примеров автоматических мыслей:
 • «Когда я выступлю с речью, меня засмеют.»
 • «Она ведёт себя нечестно.»
 • «Нет смысла продолжать пытаться.»
 • «Если что-то пойдёт не так, я не справлюсь.»
Эти мысли являются автоматическими. Чтобы они перестали восприниматься как истинные, важно найти альтернативные формулировки. Это требует внимательности и ответственности, важно вовремя отслеживать и осознавать свои автоматические мысли, однако со временем этот процесс станет для вас привычным. Для этого используется КПТ-дневник или Дневник мыслей, доступный в разделе «Упражнения». Заимев привычку вести записи в дневнике, вы приобретаете контроль над своими мыслями и поведением, а значит сами управляете принятием решений!
            """,

            """Отлично! Теперь вы умеете распознавать автоматические мысли, и можно перейти к следующему понятию. Промежуточные убеждения — это своего рода фильтры, через которые мы воспринимаем мир. Это правила, по которым мы живём.
Рассмотрим несколько примеров:
 • «Если я что-то скажу, это обязательно будет глупостью, и меня засмеют.»
 • «Если то, что я делаю, не идеально, я неудачница.»
 • «Если я не буду беспокоиться, значит, я плохая мать.»
Зачем мне эта информация? Промежуточные убеждения существенно влияют на наши автоматические мысли. Если представить айсберг, то на его вершине находятся автоматические мысли, а ниже скрыты правила, которые формировались на основе нашего жизненного опыта. Многие из них усваиваются с детства (привет, психоанализ!).
Чаще всего это могут быть следующие стереотипы:
 • «Мужчина никогда не плачет.»
 • «Дети — несамостоятельные, беспомощные.»
 • «Женщина на корабле — плохая примета.»
 • «Без высшего образования нельзя прожить достойно.»
Таким образом, девушка с установкой «Женщина на корабле — плохая примета» может считать, что ей нет места в «мужских» профессиях, такая установка заставит девушку считать себя недостойной и неудачницей.
Важно распознать свои промежуточные убеждения и оценить их разрушительное (деструктивное) влияние на себя.
""",

            """Теперь мы подошли к началу всех начал — глубинным убеждениям. Звучит сложно, но на деле это довольно простое понятие. Аарон Бек, основатель КПТ, выделил две основные категории негативных глубинных убеждений: связанные с беспомощностью и с непринятием. Человеку могут быть присущи убеждения обеих категорий или одной из них.
Рассмотрим подробнее эти категории:
Глубинные убеждения о беспомощности:
 • «Я уязвим.»
 • «Я слаб.»
 • «Меня не уважают.»
 • «Я ни на что не способен.»
Глубинные убеждения о непринятии:
 • «Я ничего не стою.»
 • «Я плохой.»
 • «Со мной что-то не так (другие люди меня не любят).»
 • «Мне суждено получать отказы.»
Такие убеждения касаются не только отношения человека к самому себе, но также его восприятия других людей и мира в целом.
Иногда глубинные убеждения проявляются в автоматических мыслях. Вот пример с поэтапным объяснением глубинного убеждения, промежуточного убеждения и автоматической мысли:
 • Глубинное убеждение: «Я ни на что не способен.»
 • Промежуточное убеждение: «Мне всегда тяжело выполнять домашние задания самостоятельно.»
 • Автоматическая мысль: «Я не смог выполнить домашнее задание, значит, я ни на что не способен.»
Подведём итоги! Глубинное убеждение — это корень негативного восприятия. Главная задача — осознать, что это всего лишь идея, в которую мы поверили под влиянием жизненного опыта. Но не все глубинные убеждения негативные; часто мы также встречаемся с позитивными установками, такими как «Я достойный человек» или «Я хороший друг». Это значит, что на смену прежним негативным убеждениям можно создать новые, более реалистичные и поддерживающие.
Когда человек начинает осознавать свои убеждения, он постепенно берёт под контроль своё восприятие. Это как путь к подножию айсберга, где шаг за шагом человек подвергает сомнению и переосмысляет реальность, в которой жил.
"""]

    link_to_picture = ["/education/images_education_material/material_1.png",
                       "/education/images_education_material/material_2.png",
                       "",
                       "",
                       ""]
    title = ""
    theme = "Основы КПТ"
    type = 0
    link = ""

class Burnout:
    id = "557d4285-9271-4bd1-bb47-745e8fe79d9d"
    text = ["""По определению Кристины Маслач (американский психолог, разработавшая концепцию профессионального выгорания и создавшая опросник для его диагностики), выгорание — это психологический синдром, возникающий как ответ на продолжительный эмоциональный и межличностный стресс на работе. Он включает истощение, цинизм и ощущение профессиональной неэффективности, отражая несоответствие между ожиданиями профессии и личными возможностями сотрудника.
""",
            """Основные признаки профессионального выгорания
 1. Процессуальность: Выгорание развивается постепенно, накапливаясь со временем.
 2. Психологические характеристики:
 • Негативные внутренние переживания: психическое, физическое и когнитивное истощение (ухудшение памяти, работоспособности, снижения внимания и т.д.);
 • Деперсонализация: восприятие своих действий как бы со стороны, с чувством потери контроля над ними;
 • Снижение чувства компетентности и навыков адаптации;
 • Деформация личности профессионала. Эти признаки обычно проявляются поочерёдно, по мере прогрессирования выгорания.
 3. Защитная функция: Выгорание помогает экономить эмоциональные и энергетические ресурсы, защищая человека от излишней нагрузки.
 4. Сложный и многогранный феномен: Выгорание обусловлено как личностными особенностями, так и ситуационными факторами, связанными с межличностными отношениями и рабочей средой, поэтому этот процесс уникален у каждого.
 5. Возможность развития у любого: Выгорание потенциально может затронуть любого человека, поэтому профилактика имеет важное значение.
""",
            """Способы борьбы с профессиональным выгоранием:

 1. Рациональная оценка стресса. Анализируйте стрессовые ситуации с помощью дыхательных практик и ведения КПТ-дневника.
 2. Развитие социальных навыков. Улучшайте коммуникативные навыки для более конструктивного взаимодействия с коллегами.
 3. Позитивное мышление. Практикуйте методы рационального мышления, чтобы снизить влияние негативных мыслей.
 4. Эффективные стратегии поведения. Ознакомьтесь со стратегиями преодоления стресса (можно найти в разделе «Стратегии преодоления стресса»).
 5. Здоровый образ жизни. Следите за режимом: сон (6-8 часов), питание, отдых, время для хобби, общение с близкими.
 6. Тайм-менеджмент. Используйте подходящие техники управления временем: матрица Эйзенхауэра, техника Pomodoro, планирование с дневником или планером.
 7. Снижение обязательств. Учитесь отказываться от дополнительных обязанностей, сообщайте руководству о перегрузке.
""",
            """Рекомендации для предотвращения выгорания:
 • Не думайте о работе, находясь дома.
 • Во время обеденного перерыва избегайте обсуждения рабочих вопросов.
 • Доверяйте свои переживания близким или авторитетным коллегам.
Регулярные практики релаксации также помогут снизить рабочий стресс и улучшить самочувствие (рекомендуем заглянуть в раздел «Техники релаксации»).
""",
            """Не забывайте и о физическом состоянии!
 1. Занимайтесь спортом. Регулярная физическая активность помогает контролировать уровень стресса и улучшает настроение. Даже 10 минут в день могут существенно повлиять на самочувствие. Попробуйте разминку на рабочем месте вместо пролистывания новостей во время перерыва.
 2. Организуйте комфортное рабочее место. Убедитесь, что ваше рабочее пространство удобно и оснащено всем необходимым. Если нет возможности кардинально изменить обстановку, небольшие улучшения, такие как подушка для шеи или мягкая подушка для сидения, могут значительно повысить комфорт.
"""]

    link_to_picture = ["",
                       "",
                       "",
                       "",
                       ""]
    title = ""
    theme = "Выгорание"
    type = 0
    link = ""

class Breathing_techniques:
    id = "686dd773-7f39-405f-807a-7a6024f982b8"
    text = ["""Когда речь идет о стрессе, мы часто обращаем внимание на его физические проявления: учащенное дыхание, высокий пульс, потные ладони и тяжесть в голове. Эти ощущения крайне неприятны, но с помощью простых техник дыхания можно существенно облегчить состояние.
""",
            """Вот несколько принципов, используемых в дыхательных техниках:
 1. Замедление дыхания. Быстрое дыхание — это естественная реакция организма на стресс, но когда задача не требует физической активности, важно научиться замедлять дыхание. Это поможет взять его под контроль и справиться с напряжением.
 2. Удлинение выдоха. В спокойном состоянии выдох обычно длиннее вдоха. При стрессе, наоборот, выдох становится короче, что вызывает напряжение. Удлинение расслабленного выдоха помогает снизить тревогу и улучшить общее состояние.
 3. Отвлечение. Важно исключить источник стресса. Если это нечто визуальное, например, некрасивая картина, ее можно убрать из поля зрения. Но когда дело касается мыслей, нужно развивать навык отвлечения от негативных мыслей. Постарайтесь на несколько минут сосредоточиться на чем-то приятном, что может поднять настроение.
Эти методы могут помочь уменьшить поток автоматических пугающих мыслей и справиться со стрессом.""",
            """Практики
Вот несколько эффективных техник дыхания для снижения стресса и расслабления:
Дыхание 4—7—8
Эта техника проста: вы должны дышать следующим образом:
 1. Вдохните через нос на 4 секунды.
 2. Задержите дыхание на 7 секунд.
 3. Выдохните через рот на 8 секунд.
 4. Повторите 4—8 раз.
Удлинение выдоха активирует парасимпатическую нервную систему, что способствует расслаблению. (помогает настроить организм на отдых и восстановление, снижая напряжение и уровень стресса.)
Коробочное дыхание 4—4—4—4
Представьте квадрат, каждая сторона которого соответствует одному такту дыхания:
 1. Вдох на 4 счета.
 2. Задержка дыхания на 4 счета.
 3. Выдох на 4 счета.
 4. Задержка дыхания на 4 счета.
 5. Начните цикл заново и дышите так 1—5 минут.
Диафрагмальное дыхание
 1. Положите одну руку на грудь, а другую на живот. Обратите внимание на то, как вы дышите.
 2. Вдохните медленно через нос, так чтобы живот поднимался. Вдох должен длиться не менее 3 секунд.
 3. Выдохните носом, тоже медленно, на протяжении 3 секунд.
 4. Повторяйте эту практику несколько минут (например, начните с 5 минут).
Эти техники помогут улучшить насыщение клеток кислородом и снизить уровень стресса, даже если у вас нет возможности выйти на свежий воздух.
"""]

    link_to_picture = ["",
                       "",
                       ""]

    title = ""
    theme = "Дыхательные техники"
    type = 0
    link = ""

class Relaxation_techniques:
    id = "8cd36279-61f0-4959-99de-0a642959e08b"
    text = ["""Релаксация — это процесс снятия напряжения в теле и расслабления мышц, который помогает избавиться от дискомфорта, вызванного стрессом. Стрессовые ситуации часто приводят к напряжению в мышцах, например, многие из нас сжимают челюсти от гнева. Прогрессивная мышечная релаксация, разработанная Эдмундом Джекобсоном, является одним из эффективных методов борьбы с этим напряжением.
""",
            """Принципы метода
Метод основан на чередовании напряжения и расслабления мышц. 
Группы мышц можно разделить на четыре основных блока:
 1. Шея, зона затылка и лицевые мышцы.
 2. Руки и плечи.
 3. Спина и живот.
 4. Ноги.
""",
            """Выполнение упражнений
Каждый блок содержит от одного до трех упражнений, выполняемых в положении сидя. Упражнения проходят в трех этапах:
 1. Напряжение: максимально напрягите указанную группу мышц.
 2. Чувствование: обратите внимание на ощущения в напряженном состоянии.
 3. Расслабление: медленно расслабьте мышцы и проанализируйте разницу между напряжением и расслаблением.
Применяя метод прогрессивной мышечной релаксации, намного легче достичь состояния спокойствия и избавиться от физического дискомфорта в стрессовых ситуциях.""",
            """Упражнения для шеи, зоны затылка и лицевых мышц	 
 1. Наклон головы: Наклоните голову вниз, подтяните подбородок к груди, почувствуйте напряжение в шее. Зафиксируйте положение, затем медленно поднимите голову.
 2. Напряжение лба: Поднимите брови, напрягая мышцы лба. Ощутите напряжение, зафиксируйте, затем расслабьтесь.
 3. Сжатие носа: Наморщите нос, почувствуйте напряжение в передней части лица. Зафиксируйте, затем медленно расслабьтесь.
 4. Гримаса: Плотно сожмите зубы и растяните уголки губ в улыбке. Это создаст напряжение в щеках и подбородке. Зафиксируйте, затем расслабьтесь.
""",
            """Упражнения для расслабления рук и плечевого пояса	
 1. Сжатие кулаков: Сожмите руки в кулаки, почувствуйте напряжение в пальцах и предплечьях. Зафиксируйте на несколько секунд, затем медленно расслабьте кисти.
 2. Сгибание рук: Согните руки в локтях до предела, ощутите напряжение бицепсов. Зафиксируйте положение, затем медленно разогните руки и расслабьтесь.
 3. Подъем плеч: Поднимите плечи вверх максимально высоко. В наивысшей точке зафиксируйте положение, почувствуйте напряжение в мышцах плечевого пояса и шеи. Затем медленно опустите плечи и расслабьтесь.
""",
            """Упражнения для спины и живота	 
 1. Сведение лопаток: Сведите лопатки как можно ближе друг к другу, зафиксируйте положение в точке максимального напряжения, затем медленно расслабьтесь.
 2. Напряжение живота: Напрягите мышцы брюшного пресса, почувствуйте их уплотнение. Подождите несколько секунд, затем расслабьтесь.
""",
            """Упражнения для ног	
 1. Напряжение бедер: Уперев пятки в пол, напрягите мышцы бедер. Почувствуйте, как они приходят в тонус. Зафиксируйте положение, затем медленно расслабьте ноги.
 2. Растяжка икроножных мышц: Потяните носки на себя, ощущая растяжение пяточных сухожилий и напряжение икроножных мышц. Зафиксируйте положение, затем медленно расслабьте ноги.
 3. Напряжение стопы: Подожмите пальцы ног, чувствуя напряжение в подошвенных мышцах и сухожилиях ступни. Зафиксируйте положение, затем медленно разожмите пальцы, расслабив стопу.
"""]

    link_to_picture = ["",
                       "",
                       "",
                       "",
                       "",
                       "",
                       ""]

    title = ""
    theme = "Техники релаксации"
    type = 0
    link = ""

class Coping_strategies:
    id = "ae2e831a-7a1a-431d-a7b6-17eded8e4c26"
    text = ["""Копинг-стратегии — это действия, которые вы предпринимаете, чтобы справляться со стрессом. Они могут включать когнитивные, эмоциональные и поведенческие подходы, направленные на преодоление сложных ситуаций в повседневной жизни. Эффективные стратегии помогают активно решать проблемы, обращаясь к ним напрямую, самостоятельно или с поддержкой других. Неэффективные методы, такие как избегание проблемы, могут возникать из-за недостатка ресурсов и сил для её решения.
""",
            """Чтобы определить, какие стратегии преобладают у вас, можно пройти тест (Тест на мышление и восприятие ситуаций). Есть и хорошая новость! Копинг-стратегии можно развивать, поэтому если у вас преобладают неэффективные методы, можно научиться использовать более адаптивные подходы. В этом поможет дневник КПТ, так как он способствует работе с неэффективными мыслями и поведением, заменяя их на более конструктивные.""",
            """Вот некоторые примеры копинг-стратегий:
 1. Планирование: создайте план действий для решения проблемы, учитывая свои ресурсы и прошлый опыт. Это поможет не потеряться в ситуации.
 2. Конфронтация: прямой подход к разрешению проблемы, даже если решение может быть импульсивным, проявите свою энергичность!
 3. Принятие ответственности: осознание своей роли в ситуации помогает установить причинно-следственные связи.
 4. Самоконтроль: контролировать эмоции и поведение может быть сложно, но это помогает лучше справляться с трудностями.
 5. Дистанцирование: снижение значимости проблемы с помощью юмора или отвлечения поможет избежать излишних переживаний.
 6. Избегание: время от времени стоит отдохнуть и не думать о проблеме, однако важно помнить, что это не решит её.
 7. Поиск положительных сторон: умение видеть в сложной ситуации возможность для личного роста. Это помогает воспринимать вызовы как стимулы к развитию.
 8. Поиск социальной поддержки: обращение за помощью к друзьям или близким. Разделение своих переживаний может облегчить бремя и создать ощущение поддержки.
Выбор стратегии зависит от ситуации и ваших предпочтений. Главное — находить те методы, которые работают для вас!
"""]

    link_to_picture = ["",
                       "",
                       ""]

    title = ""
    theme = "Копинг стратегии"
    type = 0
    link = ""

class Smer_diary:
    id = "76184343-ef76-408e-92d7-ea1317bcb676"
    text = ["""Дневник мыслей (КПТ дневник, СМЭР дневник) — это новый, взрослый «дневник с замочком», помощник в самопознании и анализе. Он организован по структуре, позволяющей глубже понять своё поведение и изменить негативные мысли, убеждения, а затем и реакции (поведение) на события в жизни. 
""",
            """Основная цель — выявить автоматические мысли, подвергнуть их сомнению и выработать новые, более полезные.
""",
            """Для начала важно осознать, что ситуации сами по себе нейтральны; окрас им придаёт наша реакция. Негативные повторяющиеся события, а вместе с ними и негативные мысли нередко искажают воспринимаемую реальность, заставляя нас действовать, исходя из ошибочных убеждений, таких как страх перед худшим исходом или слишком строгие требования к себе. Работая над мыслями, можно заметно улучшить качество жизни.""",

            """Разберём структуру дневника мыслей:
 • Ситуация (С): Вспомните ситуацию (событие в вашей жизни), вызвавшую резкие, негативные эмоции, и опишите её подробно: с кем были, что происходило, когда и где. Обратите внимание на детали — иногда мелочи существенно влияют на восприятие.
 • Мысли (М): Теперь запишите мысли, возникшие в тот момент. Постарайтесь вспомнить о чем вы тогда думали, как сильно вы верите в этим мысли? Какие чувства они вызвали? Позвольте себе погрузиться в поток, отследите любые мысли о себе, других или происходящем.
 • Эмоции (Э): Запишите эмоции и оцените их силу от 0 до 10. Дайте себе время, прочувствуйте их. Это может быть непросто, и это нормально. Не нужно себя заставлять, но постарайтесь максимально точно описать свои эмоции.
 • Реакция (Р): Какой была ваша реакция? Промолчали, ответили грубо, избегали? Пишите честно, ведь это для вас. Какие ещё ситуации вызывают такие же действия?
Дневник мыслей поможет заметить повторяющиеся реакции и начать их менять.
"""]

    link_to_picture = ["",
                       "",
                       "",
                       ""]

    title = ""
    theme = "КПТ-дневник"
    type = 0
    link = ""