inquiries = ["Неуверенность в себе", "Нарушение сна", "Прокрастинация", "Эмоциональное выгорание",
             "Панические аттаки", "Стресс", "Тревоги и страхи", "Пищевое поведение", "Отношения в семье",
             "Сексуальные отношения", "Чувство одиночества", "Агрессия, приступы гнева",
             "Навязчивое поведение, мысли", "Утрата", "Проблемы в общении", "Трудности в построении отношений",
             "Беременность и материнство", "Принятие решения и постановка цели", "Вредные привычки", "Конфликты"]